// Р­С‚РѕС‚ СЃРєСЂРёРїС‚ РІРµС€Р°РµС‚СЊСЃСЏ РЅР° CharecterBasis Рё РІС‹РїРѕР»РЅСЏРµС‚ СЂРѕР»СЊ РѕС‚СЂРёСЃРѕРІРєРё РёРЅРІРµРЅС‚Р°СЂСЏ РёРіСЂРѕРєР°
using UnityEngine;
using System.Collections.Generic;

//int ListSlot = 0;				// РќРѕРјРµСЂ СЃР»РѕС‚Р° РІ СЃРїРёСЃРєРµ
//List<string> NamesAllObject;	// РРјРµРЅР° РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ
//List<string> DescrAllObject;	// РћРїРёСЃР°РЅРёСЏ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ
//List<Texture> TextureAllObj;	// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ

//!!!!!!! РљРѕРіРґР° СЃРґРµР»Р°СЋ РІС‹РєРёРґС‹РІР°РЅРёРµ РѕР±СЉРµРєС‚РѕРІ РЅСѓР¶РЅРѕ СЃРґРµР»Р°С‚СЊ С‡С‚РѕР±С‹ РїРµСЂРµРјРµРЅРЅР°СЏ EngagedSlots РІ СЌС‚РѕРј СЃРєСЂРёРїС‚Рµ СѓРјРµРЅСЊС€Р°Р»Р°СЃСЊ С‡С‚РѕР±С‹ РјС‹ РїСЂР°РІРёР»СЊРЅРѕ СЃРµРіРЅР°Р»Рё
// Р·РёСЂРѕРІР°Р»Рё РєРѕРіРґР° РЅСѓР¶РЅРѕ РІС‹СЃРІРµС‡РёРІР°С‚СЊ РѕРєРѕС€РєРѕ С‡С‚Рѕ РёРЅРІРµРЅС‚Р°СЂСЊ РїРѕР»РѕРЅ Р° РєРѕРіРґР° РЅРµРЅСѓР¶РЅРѕ

public class Inventory : MonoBehaviour 
{
	public Texture2D line, Backline;		// РўРµРєСЃС‚СѓСЂР° РїРѕР»РѕСЃРєРё СЃРѕСЃС‚РѕСЏРЅРёСЏ РїСЂРµРґРјРµС‚РѕРІ РІ РёРЅРІРµРЅС‚Р°СЂРµ Рё С„РѕРЅРѕРІР°СЏ РїРѕР»РѕСЃРєР°
	public Color[] colors = new Color[1];	// РњР°СЃСЃРёРІ С†РІРµС‚РѕРІ РѕР±СЏР·Р°С‚РµР»СЊРЅС‹Р№ РґР»СЏ СЌС‚РѕР№ Р»РёРЅРёРё СЃРѕСЃС‚РѕСЏС‰РёР№ РІСЃРµРіРѕ РёР· РѕРґРЅРѕРіРѕ С†РІРµС‚Р°
	Color[] colorsback = new Color[1];		// РњР°СЃСЃРёРІ С†РІРµС‚РѕРІ РѕР±СЏР·Р°С‚РµР»СЊРЅС‹Р№ РґР»СЏ СЌС‚РѕР№ Р»РёРЅРёРё СЃРѕСЃС‚РѕСЏС‰РёР№ РІСЃРµРіРѕ РёР· РѕРґРЅРѕРіРѕ С†РІРµС‚Р°
	const int AS = 40;						// Amount SlotsРњР°РєСЃРёРјР°Р»СЊРЅРѕРµ РєРѕР»РёС‡РµСЃС‚РІРѕ СЃР»РѕС‚РѕРІ РІ РёРЅРІРµРЅС‚Р°СЂРµ
	public ObjectRegisrator OR;				// РЎРґРµСЃСЊ Р»РµР¶РёС‚ СЃРєСЂРёРїС‚ ObjectRegistrator
	public PlayerController PC;				// РЎРґРµСЃСЊ Р»РµР¶РёС‚ СЃРєСЂРёРїС‚ PlayerController
	public PlayerCamera		PlCam;			// РЎРґРµСЃСЊ Р»РµР¶РёС‚ СЃРєСЂРёРїС‚ PlayerCamera
	public bool InventoryOn = false;		// РІРєР»СЋС‡РµРЅ Р»Рё РёРЅРІРµРЅС‚Р°СЂСЊ, true РіРѕРІРѕСЂРёС‚ Рѕ С‚РѕРј С‡С‚Рѕ РІРєР»СЋС‡РµРЅ
	public int EngagedSlots = 0;			// РљРѕР»РёС‡РµСЃС‚РІРѕ Р·Р°РЅСЏС‚С‹С… СЃР»РѕС‚РѕРІ РЅСѓР¶РЅРѕ С‡С‚РѕР±С‹ РЅРµ РґР°С‚СЊ Р»РѕР¶РёС‚СЊ РїСЂРµРґРјРµС‚С‹ РµСЃР»Рё РјР°РєСЃ РєРѕР» РґРѕСЃС‚РёРіРЅСѓС‚Рѕ
	public bool InvChanged = false;			// "InventoryChanged" Р‘С‹Р»Рѕ Р»Рё РёР·РјРµРЅРµРЅРѕ СЃРѕРґРµСЂР¶РёРјРѕРµ РёРЅРІРµРЅС‚Р°СЂСЏ
	public bool WeapChanged = false;		// "WeaponChenged" Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ "РћСЂСѓР¶РёРµ"
	public bool ArmorChanged = false;		// Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ "Р—Р°С‰РёС‚Р°"
	public bool FoodChanged = false;		// Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ "Р•РґР°"
	public bool MagicChanged = false;		// Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ "РњР°РіРёСЏ"
	public bool ConsChanged = false;		// "ConstructionChanged" Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ СЃ "РЎС‚СЂРѕРёС‚РµР»СЊСЃС‚РІРѕ"
	public bool OtherChanged = false;		// Р‘С‹Р»Р° Р»Рё РёР·РјРµРЅРµРЅР° РєР°С‚РµРіРѕСЂРёСЏ СЃ "Р Р°Р·РЅРѕРµ"
	public Transform CharacterBasis;		// РЎРґРµСЃСЊ Р»РµР¶РёС‚ С‚СЂР°РЅСЃС„РѕСЂРјР°С†РёСЏ РїСѓСЃС‚С‹С€РєРё РёРіСЂРѕРєР° CharacterBasis
	public GUIStyle ToolBarStyle;			// РЎС‚РёР»СЊ РєРЅРѕРїРѕРє РґР»СЏ РєР°С‚РµРіРѕСЂРёР№ РїСЂРµРґРјРµС‚РѕРІ
	public GUIStyle NameDescrObjStyle;		// РЎС‚РёР»СЊ РёРјРµРЅРё РѕР±СЉРµРєС‚Р° РІ РѕРїРёСЃР°РЅРёРё РїСЂРµРґРјРµС‚Р°
	public GUIStyle DescriptionStyle;		// РЎС‚РёР»СЊ РѕРєРЅР° РѕРїРёСЃР°РЅРёСЏ РїСЂРµРґРјРµС‚РѕРІ
	public GUIStyle CellStyle;				// РЎС‚РёР»СЊ СЏС‡РµРµРє РІ РёРЅРІРµРЅС‚Р°СЂРµ
	public GUIStyle UpperCellStyle;			// РЎС‚РёР»СЊ РґР»СЏ С‚РµРєСЃС‚Р° РІ СЏС‡РµР№РєР°С… РёРЅРІРµРЅС‚Р°СЂСЏ РѕС‚РѕР±СЂР°Р¶Р°СЋС‰РµРіРѕ РєРѕР»РёС‡РµСЃС‚РІРѕ РѕР±СЉРµРєС‚РѕРІ РёР»Рё РёС… СЃРѕСЃС‚РѕСЏРЅРёРµ
	public Rect[] UpperCells = new Rect[AS];// Р­С‚Рѕ РјР°СЃСЃРёРІ СЃ РєРѕРѕСЂРґРёРЅР°С‚Р°РјРё СЏС‡РµРµРє РёРЅРІРµРЅС‚Р°СЂСЏ СЃ РёРЅС„РѕСЂРјР°С†РёРµР№ РєРѕС‚РѕСЂС‹Рµ Р»СЏРіСѓС‚ РїРѕРІРµСЂС… РѕР±С‹С‡РЅС‹С… СЏС‡РµРµРє
	bool WasLocked = true;					// Р‘С‹Р» Р»Рё Р·Р°Р±Р»РѕРєРёСЂРѕРІР°РЅ РєСѓСЂСЃРѕСЂ
				

	// РљР°С‚РµРіРѕСЂРёРё - Р’СЃС‘, РћСЂСѓР¶РёРµ, Р—Р°С‰РёС‚Р°, Р•РґР° Рё Р·РµР»СЊСЏ, РњР°РіРёСЏ, РЎС‚СЂРѕРёС‚РµР»СЊСЃС‚РІРѕ, РџСЂРѕС‡РµРµ.. РРЅСЃС‚СЂСѓРјРµРЅС‚С‹(Tool) С…СЂР°РЅСЏС‚СЊСЃСЏ РІ РїСЂРѕС‡РµРј.
	public Texture[] CategoriesImage;		// РР·РѕР±СЂР°Р¶РµРЅРёСЏ РґР»СЏ РєР°С‚РµРіРѕСЂРёР№
	int ToolBarInt = 0;						// РќРѕРјРµСЂ РєР°С‚РµРіРѕСЂРё РєРѕС‚РѕСЂС‹Р№ СЃРµР№С‡Р°СЃ РІС‹Р±СЂР°РЅ

	// "РўР°Р»РѕРЅС‹" РЇ РЅР°Р·РІР°Р» СЌС‚РѕС‚ СЃРїРёСЃРѕРє С‚Р°Рє РїРѕС‚РѕРјСѓ С‡С‚Рѕ РЅРѕРјРµСЂР° РІ СЌС‚РѕРј СЃРїРёСЃРєРµ РїРѕС…РѕР¶Рё РЅР° Р»СЋРґРµР№ РІ РѕС‡РµСЂРµРґРё СЃ С‚Р°Р»РѕРЅР°РјРё РЈ РєР°Р¶РґРѕРіРѕ С‡РµР»РѕРІРµРєР° РµСЃС‚СЊ "С‚Р°Р»РѕРЅ"
	// РќРѕРјРµСЂ СЃ РѕРїРёСЃР°РЅРёСЏРјРё РёРјРµРЅР°РјРё Рё РїСЂРѕС‡РµРј РљР°РєР±С‹ С‚Р°Р»РѕРЅ РЅР° РїРѕР»СѓС‡РµРЅРёРµ РєРѕРЅС‚РµРЅРµСЂР° СЃ РІРµС‰Р°РјРё РЅР° СЃРєР»Р°РґРµ, Р° РЅРѕРјРµСЂ СЌС‚РѕРіРѕ С‡РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚
	// РЅРѕРјРµСЂ С‚РµРєСЃС‚СѓСЂС‹ РІ РєР°С‚РµРіРѕСЂРёРё РІСЃС‘
	public List<int> Coupons;									// РћР±СЉСЏРІР»СЏРµРј СЃРїРёСЃРѕРє "РўР°Р»РѕРЅС‹"
//-----------------------------------------------------------------------------------------------------------------------------------------------
	public string[] NamesObjects = new string[AS];				// РРјРµРЅР° РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ РЅР° "CРєР»Р°РґРµ" РёРЅС„РѕСЂРјР°С†РёРё
	public string[] DescriptionsObjects = new string[AS];		// РћРїРёСЃР°РЅРёРµ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ РЅР° "CРєР»Р°РґРµ" РёРЅС„РѕСЂРјР°С†РёРё
	public Texture[] TexturesObjects = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ РЅР° "CРєР»Р°РґРµ"
	public Type[] TypesObjects = new Type[AS];					// РўРёРїС‹ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ РЅР° "РЎРєР»Р°РґРµ"
	public int[] QueueObject = new int[AS];						// РќРѕРјРµСЂ РѕР±СЉРµРєС‚Р° РїРѕ РєРѕС‚РѕСЂРѕРјСѓ РѕРЅ СЃС‚Р°РІРёС‚СЊСЃСЏ РІ РѕС‡РµСЂРµРґРё
	public string[] PathsObjects = new string[AS];				// РџСѓС‚Рё РІСЃРµС… РѕР±РµРєС‚РѕРІ РЅР° "РЎРєР»Р°РґРµ"
	public int[] StackValue = new int[AS];						// Р’ СЌС‚РѕРј РјР°СЃСЃРёРІРµ С…СЂР°РЅСЏС‚СЊСЃСЏ Р·РЅР°С‡РµРЅРёСЏ -(РЎРєРѕР»СЊРєРѕ РѕР±СЉРµРєС‚РѕРІ РІ СЏС‡РµР№РєРµ РЅР° "РЎРєР»Р°РґРµ")
	public bool[] Destroyable = new bool[AS];					// РњР°СЃСЃРёРІ СЃРѕСЃС‚РѕСЏРЅРёР№ РѕР±СЉРµРєС‚РѕРІ РЅР° "РЎРєР»Р°РґРµ" (Р Р°Р·СЂСѓС€Р°РµРјС‹Р№ РЅРµ СЂР°Р·СЂСѓС€Р°РµРјС‹Р№)
	public float[] State = new float[AS];						// РњР°СЃСЃРёРІ СЃРѕСЃС‚РѕСЏРЅРёР№ РЅР°СЃРєРѕР»СЊРєРѕ СЃР»РѕРјР°РЅ РѕР±СЉРµРєС‚ РЅР° "РЎРєР»Р°РґРµ" (РќРѕРІС‹Р№ РёР»Рё СЃР»РѕРјР°РЅРЅС‹Р№)
//-----------------------------------------------------------------------------------------------------------------------------------------------
	public int AllNumber = 0;									// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "Р’СЃС‘"
	public Texture[] AllTextures = new Texture[AS];				// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµС… РѕР±СЉРµРєС‚РѕРІ РІ РєР°С‚РµРіРѕСЂРёРё "Р’СЃС‘"

	public int WeaponNumber = 0;								// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "РћСЂСѓР¶РёРµ"
	public Texture[] TexturesWeapon = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµРіРѕ РѕСЂСѓР¶РёСЏ РІ РєР°С‚РµРіРѕСЂРёРё "РћСЂСѓР¶РёРµ"
	
	public int ArmorNumber = 0;									// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "Р‘СЂРѕРЅСЏ"
	public Texture[] TexturesArmor = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµР№ Р±СЂРѕРЅРё РІ РєР°С‚РµРіРѕСЂРёРё "Р‘СЂРѕРЅСЏ"
	
	public int FoodNumer = 0;									// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "Р•РґР°"
	public Texture[] TexturesFood = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµР№ РµРґС‹ РІ РєР°С‚РµРіРѕСЂРёРё "Р•РґР°"
	
	public int MagicNumer = 0;									// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "РњР°РіРёСЏ"
	public Texture[] TexturesMagic = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµР№ РјР°РіРёРё РІ РєР°С‚РµРіРѕСЂРёРё "РњР°РіРёСЏ"
	
	public int ConstructionNumber = 0;							// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "РљРѕРЅСЃС‚СЂСѓРєС†РёСЏ"
	public Texture[] TexturesConstruction = new Texture[AS];	// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµС… РєРѕРЅСЃС‚СЂСѓРєС†РёР№ РІ РєР°С‚РµРіРѕСЂРёРё "РљРѕРЅСЃС‚СЂСѓРєС†РёСЏ"
	
	public int OtherNumber = 0;									// РќРѕРјРµСЂ РІС‹Р±СЂР°РЅРѕР№ СЏС‡РµР№РєРё РІ РєР°С‚РµРіРѕСЂРёРё "Р Р°Р·РЅРѕРµ"
	public Texture[] TexturesOther = new Texture[AS];			// РўРµРєСЃС‚СѓСЂС‹ РІСЃРµРіРѕ СЂР°Р·РЅРѕРіРѕ РІ РєР°С‚РµРіРѕСЂРёРё "Р Р°Р·РЅРѕРµ"
	


	void Start ()
	{
		Screen.lockCursor = true;			// Р‘Р»РѕРєРёСЂСѓРµРј РєСѓСЂСЃРѕСЂ
		CalculatePosition.GeneratePosition(935, 115, 64, 64, UpperCells, 5);
		colorsback[0] = Color.black;	// Р—Р°РґР°С‘Рј РїРµСЂРµРјРµРЅРЅРѕР№ С†РІРµС‚Р° colorsback С‡С‘СЂРЅС‹Р№ С†РІРµС‚, СЌС‚Рѕ Р±СѓРґРµС‚ С†РІРµС‚ С„РѕРЅР° РґР»СЏ РїРѕР»РѕСЃРєРё Р·РґРѕСЂРѕРІСЊСЏ РїСЂРµРґРјРµС‚Р°
		line = new Texture2D(1,1); 		// РЎРѕР·РґР°С‘Рј С‚РµРєСЃС‚СѓСЂСѓ РїРѕР»РѕСЃРєРё Р·РґРѕСЂРѕРІСЊСЏ РїСЂРµРґРјРµС‚Р° Рё РїРѕРјРµС‰Р°РµРј РµС‘ РІ РїРµСЂРµРјРµРЅРЅСѓСЋ line
		Backline = new Texture2D(1,1);	// РЎРѕР·РґР°С‘Рј С‚РµРєСЃС‚СѓСЂСѓ С„РѕРЅР° РїРѕР»РѕСЃРєРё Р·РґРѕСЂРѕРІСЊСЏ РїСЂРµРґРјРµС‚Р° Рё РїРѕРјРµС‰Р°РµРј РµС‘ РІ РїРµСЂРµРјРµРЅРЅСѓСЋ Backline
		Backline.SetPixels(colorsback);	// Р—Р°РїРѕР»РЅСЏРµРј С‚РµРєСЃС‚СѓСЂСѓ С„РѕРЅР° РїРѕР»РѕСЃРєРё Р·РґРѕСЂРѕРІСЊСЏ РїСЂРµРґРјРµС‚Р° С‡С‘СЂРЅС‹Рј
		Backline.Apply();				// РџСЂРёРјРµРЅСЏРµРј РёР·РјРµРЅРµРЅРёСЏ С†РІРµС‚Р° С„РѕРЅР°
	}


	void Update () 
	{
		if(Input.GetKeyDown(KeyCode.Tab)) // Р•СЃР»Рё РЅР°Р¶Р°С‚Р° РєРЅРѕРїРєР° РўР°Р± Рё РІС‹РєР»СЋС‡РµРЅ РёРЅРІРµРЅС‚Р°СЂСЊ
			InventoryOn = InventoryOn == false ? InventoryOn = true : InventoryOn = false; // Р’РєР»СЋС‡РµРЅ РµСЃР»Рё РІС‹РєР»СЋС‡РµРЅ, Рё РІС‹РєР»СЋС‡РµРЅ РµСЃР»Рё РІРєР»СЋС‡РµРЅ
		
		if(!InventoryOn & WasLocked == false) 	 // Р•СЃР»Рё РёРЅРІРµРЅС‚Р°СЂСЊ РІС‹РєР»СЋС‡РµРЅ Рё РїРµСЂРµРјРµРЅРЅР°СЏ "РљСѓСЂСЃРѕСЂ Р±С‹Р» Р·Р°Р±Р»РѕРєРёСЂРѕРІР°РЅ" Р»РѕР¶СЊ
		{
			OR.enabled	= true;					 // Р’РєР»СЋС‡Р°РµРј СЃРєСЂРёРїС‚ СЂРµРіРµСЃС‚СЂР°С†РёРё РѕР±СЉРµРєС‚РѕРІ
			Screen.lockCursor = true;			 // Р‘Р»РѕРєРёСЂСѓРµРј РєСѓСЂСЃРѕСЂ
			WasLocked = true;					 // Р СЃС‚Р°РІРёРј Р·РЅР°С‡РµРЅРёРµ РїРµСЂРµРјРµРЅРЅРѕР№ "РљСѓСЂСЃРѕСЂ Р±С‹Р» Р·Р°Р±Р»РѕРєРёСЂРѕРІР°РЅ" РїСЂР°РІРґР°
		}
		else if(InventoryOn & WasLocked == true) // Р•СЃР»Рё РёРЅРІРµРЅС‚Р°СЂСЊ РІРєР»СЋС‡РµРЅ Рё РїРµСЂРµРјРµРЅРЅР°СЏ "РљСѓСЂСЃРѕСЂ Р±С‹Р» Р·Р°Р±Р»РѕРєРёСЂРѕРІР°РЅ" РїСЂР°РІРґР°
		{
			OR.enabled = false;					 // РўРѕ РјС‹ РІС‹РєР»СЋС‡Р°РµРј СЃРєСЂРёРїС‚ СЂРµРіРµСЃС‚СЂРёСЂРѕРІР°РЅРёСЏ РѕР±СЉРµРєС‚РѕРІ
			Screen.lockCursor = false;			 // Р Р°Р·Р±Р»РѕРєРёСЂСѓРµРј РєСѓСЂСЃРѕСЂ
			WasLocked = false;					 // Р СЃС‚Р°РІРёРј Р·РЅР°С‡РµРЅРёРµ РїРµСЂРµРјРµРЅРЅРѕР№ "РљСѓСЂСЃРѕСЂ Р±С‹Р» Р·Р°Р±Р»РѕРєРёСЂРѕРІР°РЅ" Р»РѕР¶СЊ
		}
	}


	// РћС‚СЂРёСЃРѕРІС‹РІР°РµРј РѕР±С‰РёР№ РёРЅРІРµРЅС‚Р°СЂСЊ РµСЃР»Рё РѕРЅ РІРєР»СЋС‡РµРЅ
	void OnGUI ()
	{
		if(InventoryOn)						// Р•СЃР»Рё РёРЅРІРµРЅС‚Р°СЂСЊ РІРєР»СЋС‡РµРЅ
		{
			GUI.Box(new Rect(870, 60, 400, 580), "");			// Р РёСЃСѓРµРј РєРѕСЂРѕР±РєСѓ СЂР°Р·РјРµСЂРѕРј СЃ РѕР±Р»Р°СЃС‚СЊ РёРЅРІРµРЅС‚Р°СЂСЏ
			GUI.Box(new Rect(930, 110, 330, 522),"");			// РЎРѕР·РґР°С‘Рј РєРѕСЂРѕР±РєСѓ РІ РІРёРґРµ Р·Р°РґРЅРµРіРѕ С„РѕРЅР°
			ToolBarInt = GUI.Toolbar(new Rect(930, 70, 330, 40), ToolBarInt, CategoriesImage, ToolBarStyle);	// Р РёСЃСѓРµРј РєР°С‚РµРіРѕСЂРёРё РїСЂРµРґРјРµС‚РѕРІ

			if(GUI.Button(new Rect(970, 640, 150, 30), "Use")) // Р РёСЃСѓРµРј РєРЅРѕРїРєСѓ "РСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕР±СЉРµРєС‚" Рё РµСЃР»Рё РѕРЅР° РЅР°Р¶Р°С‚Р°...
				UseObject(); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕР±СЉРµРєС‚

			if(GUI.Button(new Rect(1120, 640, 150, 30), "Drop")) // Р РёСЃСѓРµРј РєРЅРѕРїРєСѓ "Р‘СЂРѕСЃРёС‚СЊ РѕР±СЉРµРєС‚" Рё РµСЃР»Рё РѕРЅР° РЅР°Р¶Р°С‚Р°...
				DropObject(); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р‘СЂРѕСЃРёС‚СЊ РѕР±СЉРµРєС‚"

			
			switch(ToolBarInt)
			{
			case 0:
				if(InvChanged) // Р•СЃР»Рё РњРµРЅСЏР»РѕСЃСЊ СЃРѕРґРµСЂР¶РёРјРѕРµ РёРЅРІРµРЅС‚Р°СЂСЏ
					FillCategoryAll();	// РўРѕ РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategoryAll
				AllNumber = DrawCategoryAll(AllNumber, AllTextures); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawInventory (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё "Р’СЃС‘")
				InvChanged = false;  // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РёРЅРІРµРЅС‚Р°СЂСЊ Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»СЊСЃСЏ
				break;
			case 1:
				if(WeapChanged) 	// Р•СЃР»Рё СЃРѕРґРµСЂР¶РёРјРѕРµ РєР°С‚РµРіРѕСЂРёРё "РћСЂСѓР¶РёРµ" Р±С‹Р»Рѕ РёР·РјРµРЅРµРЅРѕ
					FillCategory(TexturesWeapon, Type.Weapon);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				WeaponNumber = DrawCategory(WeaponNumber, TexturesWeapon, Type.Weapon); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё)
				WeapChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "РћСЂСѓР¶РёРµ" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			case 2:
				if(ArmorChanged)	// Р•СЃР»Рё СЃРѕРґРµСЂР¶РёРјРѕРµ РєР°С‚РµРіРѕСЂРёРё "Р‘СЂРѕРЅСЏ" Р±С‹Р»Рѕ РёР·РјРµРЅРµРЅРѕ
					FillCategory(TexturesArmor, Type.Armor);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				ArmorNumber = DrawCategory(ArmorNumber, TexturesArmor, Type.Armor); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё)
				ArmorChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "Р‘СЂРѕРЅСЏ" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			case 3:
				if(FoodChanged) // Р•СЃР»Рё СЃРѕРґРµСЂР¶РёРјРѕРµ РєР°С‚РµРіРѕСЂРёРё "Р•РґР°" Р±С‹Р»Рѕ РёР·РјРµРЅРµРЅРѕ
					FillCategory(TexturesFood, Type.Food);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				FoodNumer = DrawCategory(FoodNumer, TexturesFood, Type.Food); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё)
				FoodChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "Р•РґР°" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			case 4:
				if(MagicChanged) // Р•СЃР»Рё СЃРѕРґРµСЂР¶РёРјРѕРµ РєР°С‚РµРіРѕСЂРёРё "РњР°РіРёСЏ" Р±С‹Р»Рѕ РёР·РјРµРЅРµРЅРѕ
					FillCategory(TexturesMagic, Type.Magic);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				MagicNumer = DrawCategory(MagicNumer, TexturesMagic, Type.Magic); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё)
				MagicChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "РњР°РіРёСЏ" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			case 5:
				if(ConsChanged) // Р•СЃР»Рё РєР°С‚РµРіРѕСЂРёСЏ "РЎС‚СЂРѕРёС‚РµР»СЊСЃС‚РІРѕ" Р±С‹Р»Р° РёР·РјРµРЅРµРЅР°
					FillCategory(TexturesConstruction, Type.Construction);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				ConstructionNumber = DrawCategory(ConstructionNumber, TexturesConstruction, Type.Construction); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty
				ConsChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "ConstructionChanged" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			case 6:
				if(OtherChanged) // Р•СЃР»Рё РєР°С‚РµРіРѕСЂРёСЏ "Р Р°Р·РЅРѕРµ" Р±С‹Р»Р° РёР·РјРµРЅРµРЅР°
					FillCategory(TexturesOther, Type.Other);  // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ FillCategory
				OtherNumber = DrawCategory(OtherNumber, TexturesOther, Type.Other); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DrawCategoty (РћС‚СЂРёСЃРѕРІРєР° РєР°С‚РµРіРѕСЂРёРё)
				OtherChanged = false; // Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "OtherChanged" Р±РѕР»СЊС€Рµ РЅРµ РёР·РјРµРЅСЏР»Р°СЃСЊ
				break;
			}
		}
	}

		
	// РћР±СЉСЏРІР»СЏРµРј РјРµС‚РѕРґ DrawInventory РѕРЅ Р·Р°РЅРёРјР°РµС‚СЊСЃСЏ РѕС‚СЂРёСЃРѕРІРєРѕР№ РёРЅРІРµРЅС‚Р°СЂСЏ РІ РєР°С‚РµРіРѕСЂРёРё "Р’СЃС‘"
	int DrawCategoryAll(int number, Texture[] textures)
	{
		number = GUI.SelectionGrid(new Rect(935, 115, 320, 512), number, textures, 5, CellStyle); 				// Р РёСЃСѓРµРј СЃР»РѕС‚С‹ РёРЅРІРµРЅС‚Р°СЂСЏ
		// Р РёСЃСѓРµРј "РљРѕСЂРѕР±РєРё" СЃ С†РёС„СЂР°РјРё РёР»Рё СЃРѕСЃС‚РѕСЏРЅРёРµРј РїСЂРµРґРјРµС‚РѕРІ РґР»СЏ СЃР»РѕС‚РѕРІ РёРЅРІРµРЅС‚Р°СЂСЏ
		for(int i=0; Coupons[i] != -1; i++) // РџСЂРѕРґРѕР»Р¶Р°РµРј С†РёРєР» РґРѕ С‚РµС… РїРѕСЂ РїРѕРєР° РЅРѕРјРµСЂ РєСѓРїРѕРЅР° РЅРµ СЂР°РІРµРЅ -1
		{
			if(StackValue[Coupons[i]] >1) // Р•СЃР»Рё Р·РЅР°С‡РµРЅРёРµ РєРѕР»РёС‡РµСЃС‚РІР° РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ РЅР° СЃРєР»Р°РґРµ Р±РѕР»СЊС€Рµ РѕРґРЅРѕРіРѕ
				GUI.Box(UpperCells[i], ""+StackValue[Coupons[i]], UpperCellStyle); // РўРѕ РѕС‚СЂРёСЃРѕРІС‹РІР°РµРј РєРѕР»РёС‡РµСЃС‚РІРѕ РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ
			// Р•СЃР»Рё РѕР±СЉРµРєС‚ РІ СЏС‡РµР№РєРµ РЅР° "РЎРєР»Р°РґРµ" СЂР°Р·СЂСѓС€Р°РµРјС‹Р№ Р° РµРіРѕ Р·РЅР°С‡РµРЅРёРµ С†РµР»РѕСЃС‚РЅРѕСЃС‚Рё Р±РѕР»СЊС€Рµ 0% Рё РјРµРЅРµРµ 100%
			if(Destroyable[Coupons[i]] == true & State[Coupons[i]] > 0 & State[Coupons[i]] < 100) 
			{	// РўРѕ РјС‹ РѕС‚СЂРёСЃРѕРІС‹РІР°РµРј РїРѕР»РѕСЃРєСѓ СЃРѕСЃС‚РѕСЏРЅРёСЏ РїСЂРµРґРјРµС‚Р° РґР»СЏ СЌС‚РѕР№ СЏС‡РµР№РєРё
				colors[0] = Color.Lerp(Color.red, Color.green, State[Coupons[i]]/100 ); // СЃРЅР°С‡Р°Р»Р° РѕРїСЂРµРґРµР»СЏРµРј С†РІРµС‚
				line.SetPixels(colors); // РїСЂРёСЃРІР°РёРІР°РµРј СЌС‚РѕС‚ С†РІРµС‚ РїРѕР»РѕСЃРєРµ РєРѕС‚РѕСЂСѓСЋ РјС‹ РѕС‚СЂРёСЃСѓРµРј РІ СЌС‚РѕРј С†РёРєР»Рµ, РІ СЌС‚РѕР№ СЏС‡РµР№РєРµ
				line.Apply(); 			// РЎРѕС…СЂР°РЅСЏРµРј РёР·РјРµРЅРµРЅРёРµ С†РІРµС‚Р° С‚РµРєСЃС‚СѓСЂС‹ РїРѕР»РѕСЃРєРё
				// РћС‚СЂРёСЃРѕРІС‹РІР°РµРј Р¶РёР·РЅРё РїСЂРµРґРјРµС‚Р° Рё Р·Р°РґРЅРёС„ С„РѕРЅ Р¶РёР·РЅРµР№
				GUI.DrawTexture(new Rect(UpperCells[i].position.x + 7, UpperCells[i].position.y + 58, 50, 3), Backline);
				GUI.DrawTexture(new Rect(UpperCells[i].position.x + 7, UpperCells[i].position.y + 58, 50*State[Coupons[i]]/100, 3), line);
				if(i==AS-1) break; // Р•СЃР»Рё РЅРѕРјРµСЂ С†РёРєР»Р° СЃС‚Р°Р» СЂР°РІРµРЅ РєРѕР»РёС‡РµСЃС‚РІСѓ СЏС‡РµРµРє -1 С‚Рѕ РїСЂРµРєСЂР°С‰Р°РµРј С†РёРєР»
			}
		}
	

		// РћС‚СЂРёСЃРѕРІС‹РІР°РµРј РѕРєРЅРѕ РёРЅС„РѕСЂРјР°С†РёРё
		if(Coupons[number] != -1) // Р•СЃР»Рё Сѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" СЃ РЅРѕРјРµСЂРѕРј РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµРєРё РЅРѕРјРµСЂРѕРє РЅРµ СЂР°РІРµРЅ -1 РћС‚СЂРёСЃРѕРІС‹РІРµРј РѕРєРЅРѕ РёРЅС„РѕСЂРјР°С†РёРё
		{
			GUI.Box(new Rect(300, 635, 650, 175), "", DescriptionStyle);	// Р РёСЃСѓРµРј РѕРєРЅРѕ (РљРѕСЂРѕР±РєР°) РёРЅС„РѕСЂРјР°С†Рё Рѕ РїСЂРµРґРјРµС‚Рµ

			// Р РёСЃСѓРµРј СЌС‚РёРєРµС‚РєСѓ СЃ РёРјРµРЅРµРј РїСЂРµРґРјРµС‚Р° СЃРѕ СЃРєР»Р°РґР° СЂР°РІРЅС‹Р№ РЅРѕРјРµСЂРєСѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" Р° "Р§РµР»РѕРІРµРє" СЂР°РІРµРЅ РЅРѕРјРµСЂСѓ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРё
			GUI.Label(new Rect(300, 635, 210, 25), NamesObjects[Coupons[number]], NameDescrObjStyle);

			// Р•СЃР»Рё РІ РјР°СЃСЃРёРІРµ descriptionObject (РќРѕРјРµСЂ СЌР»РµРјРµРЅС‚Р° РёР· РїРµСЂРµРјРµРЅРЅРѕР№ Coupons[number]) РѕРїРёСЃР°РЅРёРµ РЅРµ СЂР°РІРЅРѕ РїСѓСЃС‚РѕРјСѓ РїРѕР»СЋ
			if(DescriptionsObjects[Coupons[number]] != "") 
				GUI.Label(new Rect(650, 660, 300, 150), DescriptionsObjects[Coupons[number]]);// РўРѕ СЂРёСЃСѓРµРј С‚РµРєСЃС‚РѕРІРѕРµ РїРѕР»Рµ СЃ РѕРїРёСЃР°РЅРёРµРј.
			else 						 // Р•СЃР»Рё Р¶Рµ РѕРїРёСЃР°РЅРёРµ СЂР°РІРЅРѕ РїСѓСЃС‚РѕРјСѓ С‚РµРєСЃС‚Сѓ (РўРѕРµСЃС‚СЊ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚)
				GUI.Label(new Rect(650, 660, 300, 150), "РћРїРёСЃР°РЅРёРµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚"); // Р РёСЃСѓРµРј С‚РµРєСЃС‚РѕРІРѕРµ РїРѕР»Рµ Рё РїРёС€РµРј "РћРїРёСЃР°РЅРёРµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚"

			if(TexturesObjects[Coupons[number]] != null) // Р•СЃР»Рё РЅР° СЃРєР»Р°РґРµ РёРЅРІРµРЅС‚Р°СЂСЏ( РЎР»РѕС‚ СЃРєР»Р°РґР° СЂР°РІРµРЅ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРё) РµСЃС‚СЊ С‚РµРєСЃС‚СѓСЂР°
				GUI.DrawTexture(new Rect(301, 661, 148, 148), TexturesObjects[Coupons[number]]); // Р РёСЃСѓРµРј С‚РµРєСЃС‚СѓСЂСѓ РёР· СЏС‡РµР№РєРё СЃРєР»Р°РґР°
		}
		return number;
	}


	// РћР±СЉСЏРІР»СЏРµРј РјРµС‚РѕРґ DrawCategory РѕРЅ Р·Р°РЅРёРјР°РµС‚СЊСЃСЏ РѕС‚СЂРёСЃРѕРІРєРѕР№ РёРЅРІРµРЅС‚Р°СЂСЏ РІ РІС‹Р·РІР°РЅРЅРѕР№ РєР°С‚РµРіРѕСЂРёРё
	int DrawCategory(int number, Texture[] textures, Type type)
	{
		number = GUI.SelectionGrid(new Rect(935, 115, 320, 512), number, textures, 5, CellStyle); // СЂРёСЃСѓРµРј СЃР»РѕС‚С‹ РёРЅРІРµРЅС‚Р°СЂСЏ

		int calCup; // "calculatedCupon" РљСѓРїРѕРЅ РІ РёС‚РµСЂР°С†РёРё[i] РєРѕС‚РѕСЂС‹Р№ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ СЏС‡РµР№РєРµ РІ РёС‚РµСЂР°С†РёРё[i]

		// Р РёСЃСѓРµРј "РљРѕСЂРѕР±РєРё" СЃ С†РёС„СЂР°РјРё РёР»Рё СЃРѕСЃС‚РѕСЏРЅРёРµРј РїСЂРµРґРјРµС‚РѕРІ РґР»СЏ СЃР»РѕС‚РѕРІ РёРЅРІРµРЅС‚Р°СЂСЏ
		for(int i=0; textures[i] != null; i++) // РџСЂРѕРґРѕР»Р¶Р°РµРј С†РёРєР» РґРѕ С‚РµС… РїРѕСЂ РїРѕРєР° РЅРµ РєРѕРЅС‡Р°С‚СЊСЃСЏ С‚РµРєСЃС‚СѓСЂС‹ РІ РѕРїСЂР°С€РёРІР°РµРјРѕР№ РєР°С‚РµРіРѕСЂРёРё
		{
			calCup = CalculateCupon(i, type); // РљР°Р¶РґСѓСЋ РёС‚РµСЂР°С†РёСЋ РЅР°С…РѕРґРёРј РєСѓРїРѕРЅР° СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‰РµРіРѕ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРµ РІ РІС‹Р±СЂР°РЅРЅРѕР№ РєР°С‚РµРіРѕСЂРёРё
			// Р•СЃР»Рё Р·РЅР°С‡РµРЅРёРµ РєРѕР»РёС‡РµСЃС‚РІР°РІР° РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ РЅР° "CРєР»Р°РґРµ" РЅРµ СЂР°РІРЅРѕ РЅСѓР»СЋ
			if(StackValue[Coupons[calCup]] >1) 
				GUI.Box(UpperCells[i], ""+StackValue[Coupons[calCup]], UpperCellStyle); // РўРѕ РѕС‚СЂРёСЃРѕРІС‹РІР°РµРј РєРѕР»РёС‡РµСЃС‚РІРѕ РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ
			// Р•СЃР»Рё РѕР±СЉРµРєС‚ РІ СЏС‡РµР№РєРµ РЅР° "РЎРєР»Р°РґРµ" СЂР°Р·СЂСѓС€Р°РµРјС‹Р№ Р° РµРіРѕ Р·РЅР°С‡РµРЅРёРµ С†РµР»РѕСЃС‚РЅРѕСЃС‚Рё Р±РѕР»СЊС€Рµ 0% Рё РјРµРЅРµРµ 100%
			if(Destroyable[Coupons[calCup]] == true & State[Coupons[calCup]] > 0 & State[Coupons[calCup]] < 100)
			{
				// РўРѕ РјС‹ РѕС‚СЂРёСЃРѕРІС‹РІР°РµРј РїРѕР»РѕСЃРєСѓ СЃРѕСЃС‚РѕСЏРЅРёСЏ РїСЂРµРґРјРµС‚Р° РґР»СЏ СЌС‚РѕР№ СЏС‡РµР№РєРё
				colors[0] = Color.Lerp(Color.red, Color.green, State[Coupons[calCup]]/100 ); // СЃРЅР°С‡Р°Р»Р° РѕРїСЂРµРґРµР»СЏРµРј С†РІРµС‚
				line.SetPixels(colors); // РїСЂРёСЃРІР°РёРІР°РµРј СЌС‚РѕС‚ С†РІРµС‚ РїРѕР»РѕСЃРєРµ РєРѕС‚РѕСЂСѓСЋ РјС‹ РѕС‚СЂРёСЃСѓРµРј РІ СЌС‚РѕРј С†РёРєР»Рµ, РІ СЌС‚РѕР№ СЏС‡РµР№РєРµ
				line.Apply(); 			// РЎРѕС…СЂР°РЅСЏРµРј РёР·РјРµРЅРµРЅРёРµ С†РІРµС‚Р° С‚РµРєСЃС‚СѓСЂС‹ РїРѕР»РѕСЃРєРё
				GUI.DrawTexture(new Rect(UpperCells[i].position.x + 7, UpperCells[i].position.y + 58, 50, 3), Backline);
				GUI.DrawTexture(new Rect(UpperCells[i].position.x + 7, UpperCells[i].position.y + 58, 50*State[Coupons[calCup]]/100, 3), line);
			}

			if(i==AS-1) break; // Р•СЃР»Рё РЅРѕРјРµСЂ С†РёРєР»Р° СЃС‚Р°Р» СЂР°РІРµРЅ РєРѕР»РёС‡РµСЃС‚РІСѓ СЏС‡РµРµРє -1 С‚Рѕ РїСЂРµРєСЂР°С‰Р°РµРј С†РёРєР» РІРѕ РёР·Р±РµР¶Р°РЅРёРё РѕС€РёР±РєРё
		}

		int coup;	// РќРѕРјРµСЂ РєСѓРїРѕРЅР° РєРѕС‚РѕСЂС‹Р№ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ РЅРѕРјРµСЂСѓ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРё РІ РёРЅРІРµРЅС‚Р°СЂРµ
		coup = CalculateCupon(number, type); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ РІС‹С‡РёСЃР»СЏСЋС‰РёР№ РЅРѕРјРµСЂ РєСѓРїРѕРЅР° Рє РєРѕС‚РѕСЂРѕРјСѓ РјС‹ Р±СѓРґРµРј РѕР±СЂР°С‰Р°С‚СЊСЃСЏ Р·Р° РЅРѕРјРµСЂРѕРј СЏС‡РµР№РєРё "CРєР»Р°РґР°"

		// РћС‚СЂРёСЃРѕРІС‹РІР°РµРј РѕРєРЅРѕ РёРЅС„РѕСЂРјР°С†РёРё
		if(coup != -1) // Р•СЃР»Рё coup РЅРµ СЂР°РІРµРЅ -1 РћС‚СЂРёСЃРѕРІС‹РІР°РµРј РѕРєРЅРѕ c РёРЅС„РѕСЂРјР°С†РёРµР№ РѕР± РѕР±СЉРµРєС‚Рµ
		{
			GUI.Box(new Rect(300, 635, 650, 175), "", DescriptionStyle);	// Р РёСЃСѓРµРј РѕРєРЅРѕ (РљРѕСЂРѕР±РєР°) РёРЅС„РѕСЂРјР°С†Рё Рѕ РїСЂРµРґРјРµС‚Рµ

			// Р РёСЃСѓРµРј СЌС‚РёРєРµС‚РєСѓ СЃ РёРјРµРЅРµРј РїСЂРµРґРјРµС‚Р° СЃРѕ СЃРєР»Р°РґР° СЂР°РІРЅС‹Р№ РЅРѕРјРµСЂРєСѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" Р° "Р§РµР»РѕРІРµРє" СЂР°РІРµРЅ РЅРѕРјРµСЂСѓ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРё
			GUI.Label(new Rect(300, 635, 210, 25), NamesObjects[Coupons[coup]], NameDescrObjStyle);

			// Р•СЃР»Рё РІ РјР°СЃСЃРёРІРµ descriptionObject (РќРѕРјРµСЂ СЌР»РµРјРµРЅС‚Р° РёР· РїРµСЂРµРјРµРЅРЅРѕР№ coupon) РѕРїРёСЃР°РЅРёРµ РЅРµ СЂР°РІРЅРѕ РїСѓСЃС‚РѕРјСѓ РёРјРµРЅРё
			if(DescriptionsObjects[Coupons[coup]] != "") 
				GUI.Label(new Rect(650, 660, 300, 150), DescriptionsObjects[Coupons[coup]]);// РўРѕ СЂРёСЃСѓРµРј С‚РµРєСЃС‚РѕРІРѕРµ РїРѕР»Рµ СЃ РѕРїРёСЃР°РЅРёРµРј.
			else 						 // Р•СЃР»Рё Р¶Рµ РѕРїРёСЃР°РЅРёРµ СЂР°РІРЅРѕ РїСѓСЃС‚РѕРјСѓ С‚РµРєСЃС‚Сѓ (РўРѕРµСЃС‚СЊ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚)
				GUI.Label(new Rect(650, 660, 300, 150), "РћРїРёСЃР°РЅРёРµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚"); // Р РёСЃСѓРµРј С‚РµРєСЃС‚РѕРІРѕРµ РїРѕР»Рµ Рё РїРёС€РµРј "РћРїРёСЃР°РЅРёРµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚"

			if(TexturesObjects[Coupons[coup]] != null) // Р•СЃР»Рё РЅР° СЃРєР»Р°РґРµ РёРЅРІРµРЅС‚Р°СЂСЏ( РЎР»РѕС‚ СЃРєР»Р°РґР° СЂР°РІРµРЅ РїРµСЂРµРјРµРЅРЅРѕР№ coupon) РµСЃС‚СЊ С‚РµРєСЃС‚СѓСЂР°
				GUI.DrawTexture(new Rect(301, 661, 148, 148), TexturesObjects[Coupons[coup]]); // Р РёСЃСѓРµРј С‚РµРєСЃС‚СѓСЂСѓ РёР· СЏС‡РµР№РєРё СЃРєР»Р°РґР°
		}
		return number;
	}


	// Р­С‚РѕС‚ РјРµС‚РѕРґ РІС‹С‡РёСЃР»СЏРµС‚ РєСѓРїРѕРЅР° РєРѕС‚РѕСЂС‹Р№ СЃРѕРґРµСЂР¶РёС‚ С‚РµРєСЃС‚СѓСЂСѓ РІ РєР°С‚РµРіРѕСЂРёРё РјС‹ РїРѕСЃР»С‹Р°РµРј СЃСЋРґР° С‚РёРї РєР°С‚РµРіРѕСЂРёРё Рё РЅРѕРјРµСЂ РІС‹Р±СЂР°РЅРЅР№Рѕ СЏС‡РµР№РєРё РІ РѕС‚РІРµС‚ РїРѕР»СѓС‡Р°РµРј
	// РЅРѕРјРµСЂ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" РєРѕС‚РѕСЂС‹Р№ СЃРѕРґРµСЂР¶РёС‚ РІСЃСЋ РёРЅС„РѕСЂРјР°С†РёСЋ Рѕ РІС‹Р±СЂР°РЅРЅРѕРј РѕР±СЉРµРєС‚Рµ РІ РєР°С‚РµРіРѕСЂРёРё
	int CalculateCupon (int SelectedSlot, Type type)
	{
		int numberCat = -1; // РќРѕРјРµСЂ РѕР±СЉРµРєС‚Р° СЃРѕРІРїР°РІС€РёР№ СЃ С‚РёРїРѕРј РєР°С‚РµРіРѕСЂРёРё
		int coupon; // Р’С‹С‡РёСЃР»СЏРµРј РЅРѕРјРµСЂ РєСѓРїРѕРЅР° РєРѕС‚РѕСЂС‹Р№ РІ РёС‚РѕРіРµ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ РЅРѕРјРµСЂСѓ РІС‹Р±СЂР°РЅРЅРѕР№ СЏС‡РµР№РєРё РІ РёРЅРІРµРЅС‚Р°СЂРµ
		
		for(coupon = 0; true; coupon++) // Р¦РёРєР» Р±СѓРґРµС‚ СЂР°Р±РѕС‚Р°С‚СЊ РїРѕРєР° РЅРµ РїСЂРµСЂРІС‘С‚СЊСЃСЏ РѕРїРµСЂР°С‚РѕСЂРѕРј break РІРЅСѓС‚СЂРё С†РёРєР»Р° РїСЂРё РѕР±РїСЂРµРґРµР»С‘РЅРЅРѕРј СѓСЃР»РѕРІРёРё
		{
			if(Coupons[coupon] == -1) // Р•СЃР»Рё Сѓ РѕР±СЂР°Р±Р°С‚С‹РІР°РµРјРѕРіРѕ Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё С‚Р°Р»РѕРЅ СЂР°РІРµРЅ -1
			{
				coupon = -1;	// РњС‹ СЃС‚Р°РІРёРј РЅРѕРјРµСЂ РєСѓРїРѕРЅР° РєР°Рє -1
				break;			// РџСЂРµСЂС‹РІР°РµРј С†РёРєР»
			}
			else if(TypesObjects[Coupons[coupon]] == type) // Р•СЃР»Рё Сѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" РЅР° "РЎРєР»Р°РґРµ" С‚РёРї РѕР±СЉРµРєС‚Р° СЂР°РІРµРЅ РїР°СЂР°РјРµС‚СЂСѓ РјРµС‚РѕРґР° "type"
			{
				numberCat ++; // РџСЂРёР±Р°РІР»СЏРµРј Рє numberCat +1 С‡С‚РѕР±С‹ РІ РєРѕРЅС†Рµ РєРѕРЅС†РѕРІ РЅР°Р№С‚Рё РѕР±СЉРµРєС‚ РЅР° "CРєР»Р°РґРµ" РљРѕС‚РѕСЂС‹Р№ РјС‹ РІС‹Р±СЂР°Р»Рё РІ "РљР°С‚РµРіРѕСЂРёРё"
				if(SelectedSlot == numberCat)	// Р•СЃР»Рё SelectedSlot СЂР°РІРµРЅ numberCat
					break; // РџСЂРµСЂС‹РІР°РµРј С†РёРєР» С‡С‚РѕР±С‹ РЅРµ РїРѕР·РІРѕР»РёС‚СЊ РїСЂРёР±Р°РІРёС‚СЊСЃСЏ РїРµСЂРµРјРµРЅРЅРѕР№ coupon РµС‰С‘ СЂР°Р·
			}
		}
		return coupon; // РљР°Рє СЂРµР·СѓР»СЊС‚Р°С‚ СЌС‚РѕРіРѕ РјРµС‚РѕРґР° РІРѕР·РІСЂР°С‰Р°РµРј РЅРѕРјРµСЂ РєСѓРїРѕРЅР° РєРѕС‚РѕСЂС‹Р№ СЃРІСЏР·С‹РІР°РµС‚ РІС‹Р±СЂР°РЅРЅСѓСЋ СЏС‡РµР№РєСѓ Рё РѕР±СЉРµРєС‚ РЅР° СЃРєР»Р°РґРµ
	}


	// Р­С‚РѕС‚ РјРµС‚РѕРґ РІС‹Р·С‹РІР°РµС‚СЊСЃСЏ РµСЃР»Рё РІРµС‰Рё РІ РёРЅРІРµРЅС‚Р°СЂРµ Р±С‹Р»Рё РёР·РјРµРЅРµРЅС‹ Рё РєР°С‚РµРіРѕСЂРёСЏ "Р’СЃС‘" Р‘С‹Р»Р° РѕС‚РєСЂС‹С‚Р°. Р”Р»СЏ РєР°Р¶РґРѕР№ РєР°С‚РµРіРѕСЂРёРё С‚РµРєСЃС‚СѓСЂ РЅСѓР¶РµРЅ СЃРІРѕР№ РјР°СЃСЃРёРІ 
	// С‚Р°Рє РєР°Рє РјРµС‚РѕРґ SelectionGrid С‚СЂРµР±СѓРµС‚ РјР°СЃСЃРёРІ РѕРЅ РЅРµ РјРѕР¶РµС‚ СЂР°Р±РѕС‚Р°С‚СЊ СЃ СЏС‡РµР№РєР°РјРё РїРѕ РѕРґРЅРѕР№. Р’РѕС‚ РјС‹ Рё Р·Р°РїРѕР»РЅСЏРµРј СЃРґРµСЃСЊ РјР°СЃСЃРёРІ РёРЅРІРµРЅС‚Р°СЂСЏ "Р’СЃС‘" 
	void FillCategoryAll()
	{
		int number;
														 
		for(number = 0; Coupons[number] != -1; number++) // РџСЂРѕРґРѕР»Р¶Р°РµРј С†РёРєР» РґРѕ С‚РµС… РїРѕСЂ РїРѕРєР° Сѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" РЅРѕРјРµСЂ РЅРµ СЂР°РІРµРЅ -1
		{
			// РљР°Р¶РґС‹Р№ С†РёРєР» Р·Р°РїРѕР»РЅСЏРµРј СЏС‡РµР№РєРё РёРЅРІРµРЅС‚Р°СЂСЏ, РєР°Р¶РґС‹Р№ С†РёРєР» РѕРїСЂР°С€РёРІР°СЏ РїРѕ РѕРґРЅРѕРјСѓ "Р§РµР»РѕРІРµРєСѓ РІ РѕС‡РµСЂРµРґРё" РЅР° РЅРѕРјРµСЂ РµРіРѕ Р±Р°РіР°Р¶Р° РЅР° СЃРєР»Р°РґРµ
			AllTextures[number] = TexturesObjects[Coupons[number]];
			if(number == AS-1) // Р•СЃР»Рё РЅРѕРјРµСЂ СЏС‡РµР№РєРё СЂР°РІРµРЅ РєРѕРЅРµС‡РЅРѕР№ СЏС‡РµР№РєРµ
			{
				number++; // РџСЂРёР±Р°РІР»СЏРµРј Рє СЏС‡РµР№РєРµ +1 С‡С‚РѕР±С‹ РІ СЃР»РµРґСѓСЋС‰РµРј С†РёРєР»Рµ РЅРµ РѕРїСЂР°С€РёРІР°С‚СЊ РЅРµСЃСѓС‰РµСЃС‚РІСѓСЋС‰СѓСЋ СЏС‡РµР№РєСѓ
				break; 
			}
		}

		// Р­С‚РѕС‚ С†РёРєР» Р·Р°СЃС‚Р°РІРёС‚ РІСЃРµ РїРѕСЃР»РµРґСѓСЋС‰РёРµ СЏС‡РµР№РєРё РѕС‡РёСЃС‚РёС‚СЊСЃСЏ
		for(int i = number; i < AS; i++)
		{
			AllTextures[i] = null;
		}
	}

	// РўРѕР¶Рµ СЃР°РјРѕРµ С‡С‚Рѕ Рё "FillCategoryAll" С‚РѕР»СЊРєРѕ С‚СѓС‚ РјС‹ Р·Р°РїРѕР»РЅСЏРµРј РІС‹Р±СЂР°РЅРЅСѓСЋ РєР°С‚РµРіРѕСЂРёСЋ РєСЂРѕРјРµ РєР°С‚РµРіРѕСЂРёРё РІСЃС‘
	void FillCategory(Texture[] Textures ,Type type)
	{
		int Category = 0; // Р­С‚Р° РїРµСЂРµРјРµРЅРЅР°СЏ РѕС‚РјРµС‡Р°РµС‚ РЅРѕРјРµСЂ Р·Р°РїРѕР»РЅСЏРµРјРѕР№ СЏС‡РµР№РєРё РІ Р·Р°РїРѕР»РЅСЏРµРјРѕР№ РєР°С‚РµРіРѕСЂРёРё
		int number;
		// РџСЂРѕРґРѕР»Р¶Р°РµРј С†РёРєР» РїРѕРєР° РЅРµ РЅР°С‚РєРЅС‘РјСЃСЏ РЅР° "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" Сѓ РєРѕС‚РѕСЂРѕРіРѕ РЅРѕРјРµСЂ РІ С‚Р°Р»РѕРЅРµ СЂР°РІРµРЅ -1
		for(number = 0; Coupons[number] != -1; number++) 
		{
			if(TypesObjects[Coupons[number]] == type) // Р•СЃР»Рё Сѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" РЅР° "РЎРєР»Р°РґРµ" С‚РёРї РѕР±СЉРµРєС‚Р° СЂР°РІРµРЅ РїР°СЂР°РјРµС‚СЂСѓ СЌС‚РѕРіРѕ РјРµС‚РѕРґР° "type"
			{
				// РўРѕ Р·Р°РіСЂСѓР¶Р°РµРј С‚РµРєСЃС‚СѓСЂСѓ РёР· С‚РѕР№ СЏС‡РµР№РєРё СЃРєР»Р°РґР° РІ СЏС‡РµР№РєСѓ "С‚РѕР№ РєР°С‚РµРіРѕСЂРёРё СЃ РєРѕС‚РѕСЂРѕР№ РјС‹ СЃРµР№С‡Р°СЃ СЂР°Р±РѕС‚Р°РµРј" СЃ РЅРѕРјРµСЂРѕРј Category
				Textures[Category] = TexturesObjects[Coupons[number]];
				Category ++; // Р С‚Р°Рє РєР°Рє РѕРґРЅСѓ СЏС‡РµР№РєСѓ РІ РєР°С‚РµРіРѕСЂРёРё РјС‹ Р·Р°РїРѕР»РЅРёР»Рё РїСЂРёР±Р°РІР»СЏРµРј Рє WeaponCategory +1 С‡С‚РѕР±С‹ РїРѕС‚РѕРј Р·Р°РїРѕР»РЅРёС‚СЊ СЃР»РµРґСѓСЋС‰СѓСЋ
			}
			if(number == AS-1)// Р•СЃР»Рё РЅРѕРјРµСЂ СЏС‡РµР№РєРё СЂР°РІРµРЅ РєРѕРЅРµС‡РЅРѕР№ СЏС‡РµР№РєРµ
			{
				number++; // РџСЂРёР±Р°РІР»СЏРµРј Рє СЏС‡РµР№РєРµ +1 С‡С‚РѕР±С‹ РІ СЃР»РµРґСѓСЋС‰РµРј С†РёРєР»Рµ РЅРµ РѕРїСЂР°С€РёРІР°С‚СЊ РЅРµСЃСѓС‰РµСЃС‚РІСѓСЋС‰СѓСЋ СЏС‡РµР№РєСѓ
				break; // РџСЂРµСЂС‹РІР°РµРј С‚РµРєСѓС‰РёР№ С†РёРєР»
			}
		}

		// Р­С‚РѕС‚ С†РёРєР» Р·Р°СЃС‚Р°РІРёС‚ РІСЃРµ РїРѕСЃР»РµРґСѓСЋС‰РёРµ СЏС‡РµР№РєРё РѕС‡РёСЃС‚РёС‚СЊСЃСЏ
		for(int i = number; i < AS; i++)
		{
			Textures[i] = null;
		}
	}


	// Р­С‚РѕС‚ РјРµС‚РѕРґ РІС‹Р·С‹РІР°РµС‚СЊСЃСЏ РµСЃР»Рё РІРµС‰Рё РІ РёРЅРІРµРЅС‚Р°СЂРµ Р±С‹Р»Рё РёР·РјРµРЅРµРЅС‹ Рё РєР°С‚РµРіРѕСЂРёСЏ "Р’СЃС‘" Р‘С‹Р»Р° РѕС‚РєСЂС‹С‚Р°. РћРЅ Р·Р°РїРѕР»РЅСЏРµС‚ РєР°С‚РµРіРѕСЂРёСЋ РёРЅРІРµРЅС‚Р°СЂСЏ "Р’СЃС‘" 
	void UseObject()
	{
		
	}


	// Р­С‚РѕС‚ РјРµС‚РѕРґ РІС‹Р·С‹РІР°РµС‚СЊСЃСЏ РєРѕРіРґР° РЅР°Рј РЅСѓР¶РЅРѕ РІС‹Р±СЂРѕСЃРёС‚СЊ РІС‹Р±СЂР°РЅРЅС‹Р№ РѕР±СЉРµРєС‚
	void DropObject()
	{
		switch(ToolBarInt)
		{
		case 0:
			if(Coupons[AllNumber] != -1) // Р•СЃР»Рё Сѓ "Р§РµР»РѕРІРµРєР° РІ РѕС‡РµСЂРµРґРё" "РўР°Р»РѕРЅ" РЅРµ РёРјРµРµС‚ РЅРѕРјРµСЂ -1
				DropFromCategory(AllNumber);  // С‚РѕРіРґР° РјС‹ РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ...
			break;
		case 1:
			int couponOne = CalculateCupon(WeaponNumber,Type.Weapon); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" 
			if(couponOne != -1) DropFromCategory(couponOne); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFromCategory
			break;
		case 2:
			int couponTwo = CalculateCupon(ArmorNumber, Type.Armor); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°"
			if(couponTwo != -1) DropFromCategory(couponTwo); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFromCategory
			break;
		case 3:
			int couponThree = CalculateCupon(FoodNumer, Type.Food); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°"
			if(couponThree != -1) DropFromCategory(couponThree); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFromCat..
			break;
		case 4:
			int couponFourth = CalculateCupon(MagicNumer, Type.Magic); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°"
			if(couponFourth != -1) DropFromCategory(couponFourth); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFrom..
			break;
		case 5:
			int couponFifth = CalculateCupon(ConstructionNumber, Type.Construction); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°"
			if(couponFifth != -1) DropFromCategory(couponFifth); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFrom..
			break;
		case 6:
			int couponSixth = CalculateCupon(OtherNumber, Type.Other); // Р’С‹Р·С‹РІР°РµРј РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°"
			if(couponSixth != -1) DropFromCategory(couponSixth); // Р•СЃР»Рё РјРµС‚РѕРґ "Р’С‹С‡РёСЃР»РёС‚СЊ РєСѓРїРѕРЅР°" РІРµСЂРЅСѓР» РЅРµ -1 С‚РѕРіРґР° РІС‹Р·С‹РІР°РµРј РјРµС‚РѕРґ DropFrom..
			break;
		}
		EngagedSlots --;
	}

	// !!!! РќСѓР¶РЅРѕ СЃРґРµР»Р°С‚СЊ С‡С‚РѕР±С‹ РїСЂРё РїРѕРґР±РёСЂР°РЅРёРё РЅРµСЃС‚Р°РєСѓРµРјРѕРіРѕ РѕР±СЉРµРєС‚Р° РµРјСѓ С‚РѕР¶Рµ РїР»СЋСЃРѕРІР°Р»РѕСЃСЊ +1 РѕР±СЉРµРєС‚. Р§С‚РѕР±С‹ РєРѕРіРґР° РјС‹ Р±СѓРґРµРј РµРіРѕ РІС‹Р±СЂР°СЃС‹РІР°С‚СЊ 
	// РњС‹ СЃРјРѕРіР»Рё РїСЂРѕРІРµСЂРёС‚СЊ РїРѕ СЌС‚РѕР№ С†РёС„СЂРµ РІРµРґСЊ СЃС‚Р°РєСѓРµРјС‹Р№ РёР»Рё РЅРµС‚ РїРµСЂРµРјРµРЅРЅР°СЏ С‚РѕР»СЊРєРѕ РІ СЃР°РјРѕРј РѕР±СЉРµРєС‚Рµ С‚СѓС‚ С‚Р°РєРѕР№ РЅРµС‚. РџРѕСЌС‚РѕРјСѓ РјС‹ РїСЂРѕРІРµСЂСЏРµРј РїРѕ
	// РєРѕР»РёС‡РµСЃС‚РІСѓ РѕР±СЉРµРєС‚РѕРІ РІ СЏС‡РµР№РєРµ. С‚Р°РєРёРј РѕР±СЂР°Р·РѕРј Р»РµРіС‡Рµ РѕР±СЉРµРґРµРЅРёС‚СЊ РјРµС‚РѕРґС‹.. РњС‹ СЃРїСЂР°С€РёРІР°РµРј РµСЃР»Рё РІ СЏС‡РµР№РєРµ Р±РѕР»СЊС€Рµ РѕРґРЅРѕРіРѕ С‚Рѕ РјС‹ РїСЂРѕСЃС‚Рѕ СѓР±Р°РІР»СЏРµРј
	// РѕРґРёРЅ С‚Р°Рє РєР°Рє СЃРѕР·РґР°С‚СЊ РѕР±СЉРµРєС‚ РІС‹Р·С‹РІР°РµС‚СЊСЃСЏ СЂР°РЅСЊС€Рµ С‚Рѕ РµРіРѕ РІС‹Р·С‹РІР°С‚СЊ СѓР¶Рµ РЅРµРЅР°РґРѕ, РёРЅР°С‡Рµ РµСЃР»Рё Сѓ РЅР°СЃ РІ СЏС‡РµР№РєРµ РѕРґРёРЅ С‚Рѕ РјС‹ РІС‹Р·С‹РІР°РµРј СЃС‚РёСЂР°РЅРёРµ СЃРѕ СЃРєР»Р°РґР°
	// РІСЃРµС… РїР°СЂРјРµС‚СЂРѕРІ Р° С‚Р°РєР¶Рµ РјРёРЅСѓСЃСѓРµРј РјРµСЃС‚Рѕ С‡С‚Рѕ РІ СЏС‡РµР№РєРµ Сѓ РЅР°СЃ 0 РѕР±РµРєС‚РѕРІ.
	// Р’С‹Р·С‹РІР°РµРј РёР· РјРµС‚РѕРґР° DropObject РµСЃР»Рё РЅР°Рј РЅСѓР¶РЅРѕ РІС‹Р±СЂРѕСЃРёС‚СЊ РѕР±СЉРµРєС‚ РёР· Р»СЋР±РѕР№ РєР°С‚РµРіРѕСЂРёРё Р·Р° РёСЃРєР»СЋС‡РµРЅРёРµРј РєР°С‚РµРіРѕСЂРёРё "Р’СЃС‘"
	void DropFromCategory(int couponNumber)
	{
		CreateObject(couponNumber);						// Р’С‹Р·С‹РІР°РµРј С„СѓРЅРєС†РёСЋ СЃРѕР·РґР°С‚СЊ РѕР±СЉРµРєС‚
	
		switch(TypesObjects[Coupons[couponNumber]]) 	// РџРѕР»СѓС‡Р°РµРј С‚РёРї РѕР±СЉРµРєС‚Р° Рё РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ С‚РёРїР° СЌС‚РѕРіРѕ РѕР±СЉРµРєС‚Р° Р±С‹Р»Р° РёР·РјРµРЅРµРЅР°
		{
			case Type.Weapon: WeapChanged = true; break;		// Р•СЃР»Рё С‚РёРї "РћСЂСѓР¶РёРµ" С‚Рѕ РёР·РјРµРЅСЏРµРј WeapChanged РЅР° "РїСЂР°РІРґР°"
			case Type.Armor: ArmorChanged = true; break;		// Р•СЃР»Рё С‚РёРї "Р‘СЂРѕРЅСЏ" С‚Рѕ РёР·РјРµРЅСЏРµРј ArmorChanged РЅР° "РїСЂР°РІРґР°"
			case Type.Food: FoodChanged = true; break;			// Р•СЃР»Рё С‚РёРї "Р•РґР°" С‚Рѕ РёР·РјРµРЅСЏРµРј FoodChanged РЅР° "РїСЂР°РІРґР°"
			case Type.Magic: MagicChanged = true; break;		// Р•СЃР»Рё С‚РёРї "РњР°РіРёСЏ" С‚Рѕ РёР·РјРµРЅСЏРµРј MagicChanged РЅР° "РїСЂР°РІРґР°"
			case Type.Construction: ConsChanged = true; break;	// Р•СЃР»Рё С‚РёРї "РЎС‚СЂРѕРёС‚РµР»СЊСЃС‚РІРѕ" С‚Рѕ РёР·РјРµРЅСЏРµРј ConsChanged РЅР° "РїСЂР°РІРґР°"
			case Type.Other: OtherChanged = true; break;		// Р•СЃР»Рё С‚РёРї "Р Р°Р·РЅРѕРµ" С‚Рѕ РёР·РјРµРЅСЏРµРј OtherChanged РЅР° "РїСЂР°РІРґР°"
		}

		if(StackValue[Coupons[couponNumber]] > 1)	// Р•СЃР»Рё РІ СЏС‡РµР№РєРµ РІС‹Р±СЂР°РЅРЅРѕРіРѕ СЃР»РѕС‚Р° Р±РѕР»СЊС€Рµ РѕРґРЅРѕРіРѕ РѕР±СЉРµРєС‚Р°
			StackValue[Coupons[couponNumber]] --;	// РћС‚РЅРёРјР°РµРј РѕС‚ Р·РЅР°С‡РµРЅРёСЏ РєРѕР»РёС‡РµСЃС‚РІР° РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ 1

		else if(StackValue[Coupons[couponNumber]] == 1)	// Р•СЃР»Рё Р¶Рµ РІ СЏС‡РµР№РєРµ РІСЃРµРіРѕ РѕРґРёРЅ РѕР±СЉРµРєС‚
		{
			StackValue[Coupons[couponNumber]] --;					// РћС‚РЅРёРјР°РµРј РѕС‚ Р·РЅР°С‡РµРЅРёСЏ РєРѕР»РёС‡РµСЃС‚РІР° РїСЂРµРґРјРµС‚РѕРІ РІ СЏС‡РµР№РєРµ 1
			NamesObjects[Coupons[couponNumber]] = "";				// РћР±РЅСѓР»СЏРµРј РёРјСЏ РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРіРѕ РѕР±СЉРµРєС‚Р° РЅР° "РЎРєР»Р°РґРµ" 
			DescriptionsObjects[Coupons[couponNumber]] = "";		// РћР±РЅСѓР»СЏРµРј РѕРїРёСЃР°РЅРёРµ РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРіРѕ РѕР±СЉРµРєС‚Р° РЅР° "РЎРєР»Р°РґРµ" 
			TexturesObjects[Coupons[couponNumber]] = null;			// РћР±РЅСѓР»СЏРµРјРј С‚РµРєСЃС‚СѓСЂСѓ РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРіРѕ РѕР±СЉРµРєС‚Р° РЅР° "РЎРєР»Р°РґРµ"
			TypesObjects[Coupons[couponNumber]] = Type.undefined;  	// Р’С‹СЃС‚Р°РІР»СЏРµРј С‚РёРї РѕР±СЉРµРєС‚Р° РЅР° "РЎРєР»Р°РґРµ" РґР»СЏ РїСЂРёР»РёС‡РёСЏ РЅР° Р·РЅР°С‡РµРЅРёРµ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ
			QueueObject[Coupons[couponNumber]] = 0;					// Р’С‹СЃС‚Р°РІР»СЏРµРј РїСЂРёРѕСЂРёС‚РµС‚ РІ СЃРІРѕРµР№ РєР°С‚РµРіРѕСЂРёРё СЌС‚РѕРіРѕ СЃР»РѕС‚Р° РЅР° "РЎРєР»Р°РґРµ" РЅР° РЅРѕР»СЊ
			PathsObjects[Coupons[couponNumber]] = "";			// РЎС‚РёСЂР°РµРј РїСѓС‚СЊ Рє РїСЂРµС„Р°Р±Сѓ РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРіРѕ РѕР±СЉРµРєС‚Р° РЅР° "РЎРєР»Р°РґРµ"
			Coupons.RemoveAt(couponNumber);						// РЈРґР°Р»СЏРµРј РёР· РѕС‡РµСЂРµРґРё РІС‹С‡РµСЃР»РµРЅРЅРѕРіРѕ РєСѓРїРѕРЅР°
			Coupons.Add(-1);									// Р’СЃС‚Р°РІР»СЏРµРј РІ РєРѕРЅРµС† РѕС‡РµСЂРµРґРё "РќРѕРІРѕРіРѕ С‡РµР»РѕРІРµРєР°" СЃ РЅРѕРјРµСЂРѕРј -1 Рё Сѓ РЅР°СЃ СЃРЅРѕРІР° 40 С‡РµР».
			InvChanged = true;									// Р РіРѕРІРѕСЂРёРј С‡С‚Рѕ РєР°С‚РµРіРѕСЂРёСЏ "Р’СЃС‘" Р±С‹Р»Р° РёР·РјРµРЅРµРЅР°
		}
	}
	

	// Р­С‚РѕС‚ РјРµС‚РѕРґ СЃРѕР·РґР°С‘С‚ РѕР±СЉРµРєС‚ РїСЂРё РІС‹Р±СЂР°СЃС‹РІР°РЅРёРё. Р’С‹Р·С‹РІР°РµС‚СЊСЃСЏ РёР· РјРµС‚РѕРґР° DropObject
	// РџРµСЂРµРґР°С‘Рј СЃСЋРґР° РЅРѕРјРµСЂ РєСѓРїРѕРЅР° Сѓ РєРѕС‚РѕСЂРѕРіРѕ РјС‹ СЃРїСЂР°С€РёРІР°РµРј РЅРѕРјРµСЂ СЃРєР»Р°РґР° РѕС‚РєСѓРґР° РІРѕР·СЊРјС‘Рј РІСЃРµ РґР°РЅРЅС‹Рµ РѕР± РѕР±СЉРµРєС‚Рµ
	void CreateObject(int CuponNumber)
	{
		GameObject drop = Instantiate(UnityEditor.AssetDatabase.LoadAssetAtPath(PathsObjects[Coupons[CuponNumber]], typeof(GameObject))) as GameObject;
		drop.transform.position = CharacterBasis.transform.position + CharacterBasis.transform.forward + CharacterBasis.transform.up;
	}
}

